app/views/users/show.html.erb

        <p>Joined On: <%= @user.created_at.strftime("%b %d, %Y") %></p>
        <% if @user.tasks.count >= 1 %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]
SELECT COUNT(*) FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 1]]