app/controllers/tasks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @task = Task.new
    @user = User.find(params[:user_id])

INSERT INTO "tasks" ("name", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Go home"], ["location", "916 chestnut st alameda ca"], ["created_at", "2016-05-18 20:25:04.180690"], ["updated_at", "2016-05-18 20:25:04.180690"]]
---
  def create
    @task = Task.create(task_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 119]]
---
  def update
    @user = User.find(params[:user_id])
    @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
  def destroy
    @task = Task.find(params[:id])
    @user = @task.user
    if current_user == @user
      @user.tasks.destroy(@task)